Repository: mrmilu/flutter.base
Catalog: lib/src/shared/presentation/l10n/intl_*.arb
Languages: ca, eu, gl

source: --------Extensions--------
eu: --------Hedapenak--------
gl: --------Extensións--------

source: Empty
ca: Buit
eu: Hutsik
gl: Baleiro

source: Invalid CUPS
ca: CUPS invàlid
eu: CUPS baliogabea
gl: CUPS incorrecto

# invalidEmail
source: Invalid email address
ca: Correu electrònic invàlid
eu: Posta elektroniko baliogabea
gl: Correo electrónico incorrecto

# invalidPhone
source: Invalid phone number
ca: Telèfon invàlid
eu: Telefono zenbaki baliogabea
gl: Número de teléfono incorrecto

source: Too long
ca: Massa llarg
eu: Luzeegia
gl: Demasiado longo

source: Invalid name
ca: Nom invàlid
eu: Izen baliogabea
gl: Nome incorrecto

source: Too short
ca: Massa curt
eu: Laburregia
gl: Demasiado curto

# signupError
source: Registration could not be completed. If you already have an account, please try logging in.
ca: No s'ha pogut completar el registre. Si ja tens un compte, intenta iniciar sessió.
eu: Ezin izan da erregistroa osatu. Dagoeneko konturik baduzu, saiatu saioa hasten.
gl: Non foi posíbel completar o rexistro. Se xa tes unha conta, intenta iniciar sesión.

# passwordRequired
source: The password must contain at least one number, one uppercase letter, and one lowercase letter.
ca: La contrasenya ha de tenir almenys un número i almenys una lletra majúscula i una minúscula.
eu: Pasahitzak gutxienez zenbaki bat eta letra larri eta xehe bat izan behar ditu.
gl: O contrasinal debe ter polo menos un número, unha letra maiúscula e unha minúscula.

# mismatchedPasswords
source: Passwords do not match
ca: Les contrasenyes no coincideixen
eu: Pasahitzak ez datoz bat
gl: Os contrasinais non coinciden

# mismatchedEmail
source: Email addresses do not match
ca: Els correus electrònics no coincideixen
eu: Posta elektronikoak ez datoz bat
gl: Os correos electrónicos non coinciden

# nonExistentUserAndPassword
source: There is no user registered with this email address.
ca: No existeix cap usuari registrat amb aquest correu electrònic.
eu: Ez dago erabiltzaile erregistraturik helbide elektroniko horrekin.
gl: Non existe ningún usuario rexistrado con este correo electrónico.

source: Server error
ca: Error del servidor
eu: Zerbitzariaren errorea
gl: Erro do servidor

source: Internal error
ca: Error intern
eu: Barne errorea
gl: Erro interno

source: Unauthorized
ca: No autoritzat
eu: Baimenik gabe
gl: Non autorizado

# sesionExpired
source: Session expired
ca: Sessió caducada
eu: Saioa iraungi da
gl: Sesión expirada

# emailAlreadyInUser
source: The email address is already in use
ca: El correu electrònic ja està en ús
eu: Helbide elektronikoa erabilita dago
gl: O correo electrónico xa está en uso

# emailOrPasswordInvalid
source: Invalid email or password
ca: El correu electrònic o la contrasenya són invàlids
eu: Posta elektronikoa edo pasahitza baliogabea da
gl: O correo electrónico ou o contrasinal son incorrectos

source: Operation not allowed
ca: Operació no permesa
eu: Eragiketa ez da onartzen
gl: Operación non permitida

# alreadyRegisteredInDatadis
source: You are already registered in Datadis
ca: Ja estàs registrat a Datadis
eu: Jada erregistratuta zaude Datadis plataforman
gl: Xa estás rexistrado en Datadis

source: Weak password
ca: Contrasenya feble
eu: Pasahitz ahula
gl: Contrasinal feble

source: minutes
ca: minuts
eu: minutu
gl: minutos

# differentCredentials
source: The credentials are different
ca: Les credencials són diferents
eu: Egiaztagiriak ez datoz bat
gl: As credenciais son diferentes

source: Invalid credentials
ca: Credencials invàlides
eu: Egiaztagiri baliogabeak
gl: Credenciais incorrectas

source: Cancelled by user
ca: Cancel·lat per l'usuari
eu: Erabiltzaileak bertan behera utzi du
gl: Cancelado polo usuario

# requiredProduct
source: Product required
ca: Producte requerit
eu: Beharrezko produktua
gl: Produto requirido

source: Unknown error
ca: Error desconegut
eu: Errore ezezaguna
gl: Erro descoñecido

# getDocumentError
source: Unable to retrieve the document, please try again later
ca: No s'ha pogut obtenir el document, intenta-ho de nou més tard
eu: Ezin izan da dokumentua lortu, saiatu berriro beranduago
gl: Non se puido obter o documento, inténtao de novo máis tarde

source: Not supported
ca: No compatible
eu: Ez da onartzen
gl: Non admitido

source: Cancel
ca: Cancel·lar
eu: Utzi
gl: Cancelar

# minLength
source: Must contain at least {minLength} characters
ca: Ha de contenir almenys {minLength} caràcters
eu: Gutxienez {minLength} karaktere izan behar ditu
gl: Debe ter polo menos {minLength} caracteres

# includeUppercase
source: Must include at least one uppercase letter
ca: Ha d'incloure almenys una lletra majúscula
eu: Gutxienez letra larri bat izan behar du
gl: Debe incluír polo menos unha maiúscula

# includeLowercase
source: Must include at least one lowercase letter
ca: Ha d'incloure almenys una lletra minúscula
eu: Gutxienez letra xehe bat izan behar du
gl: Debe incluír polo menos unha minúscula

# includeDigit
source: Must include at least one special character
ca: Ha d'incloure almenys un caràcter especial
eu: Ikur berezi bat izan behar du gutxienez
gl: Debe incluír polo menos un carácter especial

# ibanTooLong
source: IBAN is too long
ca: L'IBAN és massa llarg
eu: IBANa luzeegia da
gl: O IBAN é demasiado longo

# ibanTooShort
source: IBAN is too short
ca: L'IBAN és massa curt
eu: IBANa laburregia da
gl: O IBAN é demasiado curto

# ibanInvalid
source: The IBAN is not valid
ca: L'IBAN no és vàlid
eu: IBANa ez da baliozkoa
gl: O IBAN non é válido

# nifInvalid
source: The NIF is not valid
ca: El NIF no és vàlid
eu: NIFa ez da baliozkoa
gl: O NIF non é válido

# nieInvalid
source: The NIE is not valid
ca: El NIE no és vàlid
eu: NIEa ez da baliozkoa
gl: O NIE non é válido

source: File not found
ca: L'arxiu no existeix
eu: Fitxategia ez da existitzen
gl: O ficheiro non existe

# problemWithSaveFile
source: There was a problem saving the file
ca: Hi ha hagut un problema en desar l'arxiu
eu: Arazoa egon da fitxategia gordetzean
gl: Houbo un problema ao gardar o ficheiro

# needFieldsRequired
source: Required fields are missing
ca: Falten camps requerits
eu: Beharrezko eremuak falta dira
gl: Faltan campos obrigatorios

# addressNotReferencedCatastral
source: Check the address, it is not cadastral referenced
ca: Revisa l'adreça, no està referenciada cadastralment
eu: Egiaztatu helbidea, ez dago erroldatua katastroan
gl: Revisa o enderezo, non está referenciado catastralmente

# cupsNotContratable
source: The CUPS cannot be contracted
ca: El CUPS no és contractable
eu: CUPS hori ezin da kontratatu
gl: O CUPS non é contratable

# cupsNotInfo
source: No CUPS information was found
ca: No s'ha trobat informació del CUPS
eu: Ez da CUPS informaziorik aurkitu
gl: Non se atopou información do CUPS

# cupsNotValid
source: The CUPS is not valid
ca: El CUPS no és vàlid
eu: CUPS ez da baliozkoa
gl: O CUPS non é válido

# contractIsBlocked
source: The contract is blocked and cannot be modified
ca: El contracte està bloquejat i no pot ser modificat
eu: Kontratua blokeatuta dago eta ezin da aldatu
gl: O contrato está bloqueado e non pode ser modificado

# powerIsLess
source: The value is below the allowed minimum
ca: El valor és inferior al mínim permès
eu: Balioa gutxieneko onartutakoa baino txikiagoa da
gl: O valor está por debaixo do mínimo permitido

# powerIsMore
source: The value is above the allowed maximum
ca: El valor és superior al màxim permès
eu: Balioa gehieneko onartutakoa baino handiagoa da
gl: O valor supera o máximo permitido

# powerIsNotValid
source: The value is not valid
ca: El valor no és vàlid
eu: Balioa ez da baliozkoa
gl: O valor non é válido

# errorAltaDatadis
source: Error registering in Datadis
ca: Error en donar d'alta a Datadis
eu: Errorea Datadis-en alta ematean
gl: Erro ao dar de alta en Datadis

# errorUploadFileOCR
source: Error uploading the file, please try again
ca: Error en carregar l'arxiu, torna-ho a intentar
eu: Errorea fitxategia igotzean, saiatu berriro
gl: Erro ao cargar o ficheiro, ténteo de novo

source: -----------==========TIME=========-----------
eu: -----------==========DENBORA=========-----------
gl: -----------==========TEMPO=========-----------

# time_lessThanOneMinute
source: Less than a minute
ca: Menys d’un minut
eu: Minutu bat baino gutxiago
gl: Menos dun minuto

# time_oneMinute
source: 1 minute
ca: 1 minut
eu: 1 minutu
gl: 1 minuto

# time_minutes
source: {value} minutes
ca: {value} minuts
eu: {value} minutu
gl: {value} minutos

# time_oneHour
source: 1 hour
ca: 1 hora
eu: 1 ordu
gl: 1 hora

# time_hours
source: {value} hours
ca: {value} hores
eu: {value} ordu
gl: {value} horas

# time_oneDay
source: 1 day
ca: 1 dia
eu: 1 egun
gl: 1 día

# time_days
source: {value} days
ca: {value} dies
eu: {value} egun
gl: {value} días

# time_oneMonth
source: 1 month
ca: 1 mes
eu: 1 hilabete
gl: 1 mes

# time_months
source: {value} months
ca: {value} mesos
eu: {value} hilabete
gl: {value} meses

# time_oneYear
source: 1 year
ca: 1 any
eu: 1 urte
gl: 1 ano

# time_years
source: {value} years
ca: {value} anys
eu: {value} urte
gl: {value} anos

source: ---------==========PAGES=========---------
ca: ---------==========PÀGINES=========---------
eu: ---------==========ORRIAK=========---------
gl: ---------==========PÁXINAS=========---------

# pageNotConnection
source: ---------Page No Connection---------
ca: ---------Pàgina Sense Connexió---------
eu: ---------Konexiorik gabe orria---------
gl: ---------Sen conexión---------

# pageNotConnection_title
source: No internet connection
ca: No tens connexió a internet
eu: Ez zaude internetera konektatuta
gl: Non tes conexión a internet

# pageNotConnection_desc
source: Please check your internet connection and try again
ca: Si us plau, revisa la teva connexió a internet i torna-ho a intentar
eu: Mesedez, egiaztatu zure internet konexioa eta saiatu berriro
gl: Revisa a túa conexión a internet e ténteo de novo

source: ---------Page App Status---------
ca: ---------Estat de l'aplicació---------
eu: ---------Aplikazioaren egoera---------
gl: ---------Estado da aplicación---------

# pageAppStatus_titleClose
source: App temporarily closed
ca: App tancada temporalment
eu: Aplikazioa aldi baterako itxita
gl: Aplicación pechada temporalmente

# pageAppStatus_titleMaintenance
source: Under maintenance
ca: En manteniment
eu: Mantentze-lanak
gl: En mantemento

# pageAppStatus_descClose
source: We are currently working to reopen the app as soon as possible.
ca: Estem treballant per tornar a obrir l’aplicació tan aviat com sigui possible.
eu: Aplikazioa berriro ireki ahal izateko ari gara lanean.
gl: Estamos traballando para reabrir a aplicación o antes posible.

# pageAppStatus_descMaintenance
source: We are fixing technical issues. The app will be available again shortly.
ca: Estem resolent problemes tècnics. Tornarem a obrir l’aplicació tan aviat com sigui possible.
eu: Arazo teknikoak konpontzen ari gara. Laster izango gara berriro erabilgarri.
gl: Estamos resolvendo problemas técnicos. A aplicación volverá estar dispoñible en breve.

source: ---------Page Splash---------
ca: ---------Pàgina de càrrega---------
eu: ---------Hasierako orria---------
gl: ---------Pantalla de carga---------

# pageSplashUpdateAvailable
source: Update available
ca: Actualització disponible
eu: Eguneratze erabilgarri
gl: Actualización dispoñible

# pageSplashUpdateAvailableDesc
source: A new version of the app is available. Please update to enjoy the latest features and improvements.
ca: Hi ha una nova versió de l'aplicació disponible. Actualitza per gaudir de les últimes funcions i millores.
eu: Aplikazioaren bertsio berri bat erabilgarri dago. Eguneratu azken funtzio eta hobekuntzak lortzeko.
gl: Hai unha nova versión da aplicación dispoñible. Actualiza para gozar das últimas funcionalidades e melloras.

# pageSplashUpdate
source: Update
ca: Actualitzar
eu: Eguneratu
gl: Actualizar

# pageSplashReload
source: Reload
ca: Tornar a carregar
eu: Birkargatu
gl: Recargar

# pageSplash_progress1
source: Checking for updates
ca: Comprovant actualitzacions
eu: Eguneratzeak egiaztatzen
gl: Comprobando actualizacións

# pageSplash_progress2
source: Checking connection
ca: Comprovant connexió
eu: Konexioa egiaztatzen
gl: Comprobando conexión

# pageSplash_progress3
source: Loading data
ca: Carregant dades
eu: Datuak kargatzen
gl: Cargando datos

# pageSplash_progress4
source: Preparing environment
ca: Preparant l'entorn
eu: Ingurunea prestatzen
gl: Preparando contorno

# extras_section
source: ---------Extras---------
ca: ---------Extres---------
eu: ---------Extra----------
